# Brewfile - Homebrew Bundle for dotfiles
# https://github.com/Homebrew/homebrew-bundle

# Taps
tap "homebrew/services"

# Command Line Tools
# =================

# Dotfile Management
brew "stow"

# Shell & Terminal
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "starship"
brew "tmux"
brew "zoxide"
brew "fzf"

# Development Tools
brew "git"
brew "git-lfs"
brew "lazygit"
brew "neovim"
brew "ripgrep"
brew "bat"
brew "lsd"
brew "tree"
brew "jq"
brew "wget"
brew "curl"

# Language Managers
brew "pyenv"
brew "pyenv-virtualenv"
brew "node"
brew "pnpm"

# Container Tools
brew "docker"
brew "docker-completion"
brew "docker-credential-helper"

# GUI Applications
# ================

# Terminals
cask "wezterm"
cask "kitty"
cask "iterm2"

# Development
cask "cursor"
cask "datagrip"
cask "docker-desktop"

# Productivity
cask "zen-browser"
cask "1password"
cask "1password-cli"
cask "hammerspoon"
cask "karabiner-elements"

# Communication
cask "slack"
cask "microsoft-teams"
cask "spotify"

# Fonts
cask "font-inconsolata-nerd-font"

# Mac App Store Apps (requires mas)
# ==================================
# mas "app-name", id: 1234567890