# Brewfile - Homebrew Bundle for dotfiles
# https://github.com/Homebrew/homebrew-bundle

# Taps
# Note: Removed deprecated/broken taps:
# - homebrew/services (deprecated and empty)
# - zen-browser/zen-browser (tap removed upstream; cask installs from core)

# Command Line Tools
# =================

# Dotfile Management
brew "stow"

# Shell & Terminal
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "zsh-completions"
brew "zsh-history-substring-search"
brew "starship"
brew "tmux"
brew "sesh"            # tmux session manager
brew "zoxide"
brew "fzf"

# Development Tools
brew "git"
brew "git-lfs"
brew "gnupg"           # GPG for commit signing
brew "lazygit"
brew "gh"              # GitHub CLI
brew "neovim"
brew "ripgrep"
brew "fd"
brew "bat"
brew "eza"             # Better ls with git integration
brew "tree"
brew "jq"
brew "wget"
brew "curl"
brew "rsync"           # Modern rsync (faster, secure)
brew "httpie"          # Better curl for APIs
brew "glow"            # Markdown renderer
brew "dust"            # Better du
brew "duf"             # Better df
brew "gping"           # Graphical ping
brew "procs"           # Better ps
brew "sd"              # Better sed
brew "gnu-sed"         # GNU sed (fast, compatible)
brew "grep"            # GNU grep (faster, broadly compatible)
brew "gawk"            # GNU awk (feature-rich, broadly compatible)
brew "choose-rust"     # Better cut (choose-rust)
brew "jless"           # JSON viewer
brew "btop"            # Modern system monitor
brew "doggo"           # Modern DNS client (actively maintained)
brew "fastfetch"       # System info display

# Language Managers
brew "pyenv"
brew "pyenv-virtualenv"
brew "node"
brew "pnpm"

# Container Tools
brew "docker"
brew "docker-completion"
brew "docker-credential-helper"

# GUI Applications
# ================

# Terminals
cask "wezterm"
cask "kitty"
cask "iterm2"

# Development
cask "cursor"
cask "datagrip"
cask "docker-desktop"

# Productivity
cask "zen-browser"
cask "1password"
cask "1password-cli"
cask "hammerspoon"
cask "karabiner-elements"

# Communication
cask "slack"
cask "microsoft-teams"
cask "spotify"

# Fonts
cask "font-inconsolata-nerd-font"

# Mac App Store Apps (requires mas)
# ==================================
# mas "app-name", id: 1234567890
